In [1]:
import numpy as np
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)

In [2]:
df_train = pd.read_csv('/Users/chidam/Desktop/santander_train_ver2.csv')

/usr/local/Cellar/ipython/7.8.0/libexec/lib/python3.7/site-packages/IPython/core/interactiveshell.py:3058: DtypeWarning: Columns (5,8,11,15) have mixed types. Specify dtype option on import or set low_memory=False.
  interactivity=interactivity, compiler=compiler, result=result)

In [3]:
df_train.head()

,fecha_dato,ncodpers,ind_empleado,pais_residencia,sexo,age,fecha_alta,ind_nuevo,antiguedad,indrel,...,ind_hip_fin_ult1,ind_plan_fin_ult1,ind_pres_fin_ult1,ind_reca_fin_ult1,ind_tjcr_fin_ult1,ind_valo_fin_ult1,ind_viv_fin_ult1,ind_nomina_ult1,ind_nom_pens_ult1,ind_recibo_ult1
0,2015-01-28,1375586,N,ES,H,35,2015-01-12,0.0,6,1.0,...,0,0,0,0,0,0,0,0.0,0.0,0
1,2015-01-28,1050611,N,ES,V,23,2012-08-10,0.0,35,1.0,...,0,0,0,0,0,0,0,0.0,0.0,0
2,2015-01-28,1050612,N,ES,V,23,2012-08-10,0.0,35,1.0,...,0,0,0,0,0,0,0,0.0,0.0,0
3,2015-01-28,1050613,N,ES,H,22,2012-08-10,0.0,35,1.0,...,0,0,0,0,0,0,0,0.0,0.0,0
4,2015-01-28,1050614,N,ES,V,23,2012-08-10,0.0,35,1.0,...,0,0,0,0,0,0,0,0.0,0.0,0

In [21]:
len(df_train)

13647309

In [18]:
# Considering only 10000 rows from top and bottom as samples records to understand the data

dftrain_1=df_train.head(10000)
dftrain_2=df_train.tail(10000)

In [19]:
dfsample=dftrain_1.append(dftrain_2)

In [20]:
# saving the sample file

dfsample.to_csv('/Users/chidam/Desktop/santander_train_sample.csv')

In [4]:
df_train["fecha_dato"].unique()

array(['2015-01-28', '2015-02-28', '2015-03-28', '2015-04-28',
       '2015-05-28', '2015-06-28', '2015-07-28', '2015-08-28',
       '2015-09-28', '2015-10-28', '2015-11-28', '2015-12-28',
       '2016-01-28', '2016-02-28', '2016-03-28', '2016-04-28',
       '2016-05-28'], dtype=object)

In [7]:
#tiprel_1mes represents the following:

# Customer relation type at the beginning of the month, A (active), I (inactive), P (former customer),R (Potential)

df_train.groupby('ncodpers')['tiprel_1mes'].count()

ncodpers
15889      17
15890      17
15891       2
15892      17
15893      17
           ..
1553685     0
1553686     0
1553687     0
1553688     0
1553689     0
Name: tiprel_1mes, Length: 956645, dtype: int64

In [22]:
#considerable number of customers have duplicate values
len(df_train.groupby('ncodpers'))

956645

In [23]:
13647309-956645

12690664

In [8]:
# indrel_1mes
# Customer type at the beginning of the month ,1 (First/Primary customer), 2 (co-owner ),P (Potential),3 (former primary)
# , 4(former co-owner)


df_train.groupby('ncodpers')['indrel_1mes'].count()

ncodpers
15889      17
15890      17
15891       2
15892      17
15893      17
           ..
1553685     0
1553686     0
1553687     0
1553688     0
1553689     0
Name: indrel_1mes, Length: 956645, dtype: int64

In [26]:
df_train.groupby('ncodpers')['indrel_1mes'].filter(lambda group: group==2)

TypeError: the filter must return a boolean result

In [28]:
Grouping by 'indrel_1mes' to understand the value distribution in the column: indrel_1mes

df_indrel_1mes=pd.DataFrame({'count_of_indrel_1mes' : df_train.groupby(['ncodpers','indrel_1mes']).size()}).reset_index()

In [30]:
As can be seen there are only a fewer records in the co-owner category

2 (co-owner )


df_indrel_1mes.loc[df_indrel_1mes['indrel_1mes']==2]

         ncodpers indrel_1mes  count_of_indrel_1mes
285         16063           2                     1
723         16536           2                     1
4146        19812           2                     1
4549        20243           2                     1
7006        22635           2                     1
...           ...         ...                   ...
1709069   1462064           2                     1
1718689   1467355           2                     1
1741791   1482426           2                     1
1755706   1490304           2                     1
1759818   1492540           2                     1

[352 rows x 3 columns]

In [31]:
P (Potential)

df_indrel_1mes.loc[df_indrel_1mes['indrel_1mes']=='P']

         ncodpers indrel_1mes  count_of_indrel_1mes
25705       42865           P                     1
26349       43521           P                     1
29226       46374           P                     1
29370       46507           P                     1
29622       46732           P                     1
...           ...         ...                   ...
1804976   1542553           P                     1
1805272   1542917           P                     1
1806711   1544952           P                     1
1808635   1547673           P                     1
1809125   1548326           P                     1

[873 rows x 3 columns]

In [32]:
1 (First/Primary customer)

df_indrel_1mes.loc[df_indrel_1mes['indrel_1mes']==1]

         ncodpers indrel_1mes  count_of_indrel_1mes
0           15889           1                    13
2           15890           1                    13
4           15891           1                     1
6           15892           1                    13
8           15893           1                    13
...           ...         ...                   ...
1767631   1496835           1                     1
1767633   1496836           1                     1
1797551   1532765           1                     1
1797553   1532766           1                     1
1797555   1532769           1                     1

[861710 rows x 3 columns]

In [33]:
3 (former primary)

df_indrel_1mes.loc[df_indrel_1mes['indrel_1mes']==3]

         ncodpers indrel_1mes  count_of_indrel_1mes
2295        17960           3                     1
2366        18009           3                     2
4361        20045           3                     1
4644        20340           3                     1
4917        20588           3                     1
...           ...         ...                   ...
1703923   1459172           3                     1
1710522   1462864           3                     1
1713855   1464736           3                     1
1737036   1479752           3                     1
1762975   1494286           3                     1

[1335 rows x 3 columns]

In [34]:
4(former co-owner)

df_indrel_1mes.loc[df_indrel_1mes['indrel_1mes']==4]

         ncodpers indrel_1mes  count_of_indrel_1mes
674         16502           4                     1
2542        18146           4                     1
8745        24415           4                     1
9078        24763           4                     1
19445       35843           4                     1
...           ...         ...                   ...
1527786   1338926           4                     1
1563781   1359579           4                     1
1565321   1360474           4                     1
1604516   1385774           4                     1
1661491   1432819           4                     1

[93 rows x 3 columns]

In [ ]:
Concerns:
In this python notebook, I am looking into two columns: tiprel_1mes and indrel_1mes
    
Not sure whether tiprel_1mes is same as indrel_1mes

In [12]:
df_train.loc[df_train['ncodpers']==15889, 'tiprel_1mes']

416965      A
836224      A
1673961     A
1882060     A
3144382     A
3565837     A
4078996     A
5319234     A
5705188     A
6973298     A
7450451     A
8617992     A
9401570     A
10426092    A
11170871    A
12221013    A
13026343    A
Name: tiprel_1mes, dtype: object

In [14]:
df_train.loc[df_train['ncodpers']==15889, 'indrel_1mes']

416965      1
836224      1
1673961     1
1882060     1
3144382     1
3565837     1
4078996     1
5319234     1
5705188     1
6973298     1
7450451     1
8617992     1
9401570     1
10426092    1
11170871    1
12221013    1
13026343    1
Name: indrel_1mes, dtype: object

In [ ]:
-----------------------------------------------------------------------------------------------------------------------

In [13]:
df_train.loc[df_train['ncodpers']==15890, 'tiprel_1mes']

416966      A
836223      A
1673960     A
2092183     A
3144383     A
3565760     A
4078995     A
5319233     A
5705187     A
6909778     A
7450450     A
8617993     A
9401569     A
10426091    A
11170870    A
12221014    A
13026342    A
Name: tiprel_1mes, dtype: object

In [15]:
df_train.loc[df_train['ncodpers']==15890, 'indrel_1mes']

416966      1
836223      1
1673960     1
2092183     1
3144383     1
3565760     1
4078995     1
5319233     1
5705187     1
6909778     1
7450450     1
8617993     1
9401569     1
10426091    1
11170870    1
12221014    1
13026342    1
Name: indrel_1mes, dtype: object

In [ ]:
-----------------------------------------------------------------------------------------------------------------------

In [16]:
df_train.loc[df_train['ncodpers']==15891, 'tiprel_1mes']

4078994    A
5319232    A
Name: tiprel_1mes, dtype: object

In [17]:
df_train.loc[df_train['ncodpers']==15891, 'indrel_1mes']

4078994    2
5319232    1
Name: indrel_1mes, dtype: object

In [ ]:
Result of the analysis so far

From grouping by and catagorizing I have understood that months and date play a role. Therefore why not groupby the 
dataframe by the last month, i.e., '2016-05-28' and go from there

In [35]:
df_train.head()

,fecha_dato,ncodpers,ind_empleado,pais_residencia,sexo,age,fecha_alta,ind_nuevo,antiguedad,indrel,...,ind_hip_fin_ult1,ind_plan_fin_ult1,ind_pres_fin_ult1,ind_reca_fin_ult1,ind_tjcr_fin_ult1,ind_valo_fin_ult1,ind_viv_fin_ult1,ind_nomina_ult1,ind_nom_pens_ult1,ind_recibo_ult1
0,2015-01-28,1375586,N,ES,H,35,2015-01-12,0.0,6,1.0,...,0,0,0,0,0,0,0,0.0,0.0,0
1,2015-01-28,1050611,N,ES,V,23,2012-08-10,0.0,35,1.0,...,0,0,0,0,0,0,0,0.0,0.0,0
2,2015-01-28,1050612,N,ES,V,23,2012-08-10,0.0,35,1.0,...,0,0,0,0,0,0,0,0.0,0.0,0
3,2015-01-28,1050613,N,ES,H,22,2012-08-10,0.0,35,1.0,...,0,0,0,0,0,0,0,0.0,0.0,0
4,2015-01-28,1050614,N,ES,V,23,2012-08-10,0.0,35,1.0,...,0,0,0,0,0,0,0,0.0,0.0,0

In [ ]:
tiprel_1mes: Customer relation type at the beginning of the month, A (active), I (inactive), P (former customer),
R (Potential)

In [43]:
r1=pd.DataFrame(df_train.loc[df_train['fecha_dato']=='2016-05-28', ['ncodpers','tiprel_1mes']])

In [44]:
r1.head()

          ncodpers tiprel_1mes
12715856    657640           I
12715857    657788           A
12715858    657795           A
12715859    657790           A
12715860    657794           A

In [49]:
len(r1)

931453

In [52]:
#to check whether there are duplicate records for customers? but this command is not very useful to answer that question

r1.groupby('ncodpers')['tiprel_1mes'].count()

ncodpers
15889      1
15890      1
15892      1
15893      1
15894      1
          ..
1553685    0
1553686    0
1553687    0
1553688    0
1553689    0
Name: tiprel_1mes, Length: 931453, dtype: int64

In [45]:
P (former customer): are you going to recommend a product. in that case which product would you recommend

r1.loc[r1['tiprel_1mes']=="P"]

          ncodpers tiprel_1mes
12716771    655909           P
12717926    661157           P
12718406    662074           P
12719322    660137           P
12720394    650967           P
...            ...         ...
13621906   1175125           P
13623525   1174380           P
13631825   1186014           P
13632312   1185110           P
13641337   1168909           P

[330 rows x 2 columns]

In [46]:
A (active): these are active customers for the month we care about: '2015-01-28'

r1.loc[r1['tiprel_1mes']=="A"]

          ncodpers tiprel_1mes
12715857    657788           A
12715858    657795           A
12715859    657790           A
12715860    657794           A
12715862    657789           A
...            ...         ...
13647280   1166761           A
13647290   1166779           A
13647291   1166778           A
13647294   1166775           A
13647306   1166763           A

[392607 rows x 2 columns]

In [47]:


r1.loc[r1['tiprel_1mes']=="R"]

          ncodpers tiprel_1mes
12715899    657817           R
12725762    678711           R
12749384    716631           R
12753385    737869           R
12776627    526294           R
...            ...         ...
13617349   1126850           R
13618894   1179683           R
13627820   1190195           R
13631750   1186046           R
13632377   1185013           R

[77 rows x 2 columns]

In [48]:

r1.loc[r1['tiprel_1mes']=="I"]

          ncodpers tiprel_1mes
12715856    657640           I
12715861    657797           I
12715863    657787           I
12715864    657777           I
12715865    657782           I
...            ...         ...
13647302   1166767           I
13647303   1166766           I
13647304   1166765           I
13647305   1166764           I
13647307   1166789           I

[534429 rows x 2 columns]

In [50]:
len(r1) is 931453


534429+392607+77+330

927443

In [51]:
Maybe these records are blank without any values

931453-927443

4010

In [57]:
(df_train.isnull().sum())*100/len(df_train)

fecha_dato                0.000000
ncodpers                  0.000000
ind_empleado              0.203220
pais_residencia           0.203220
sexo                      0.203732
age                       0.000000
fecha_alta                0.203220
ind_nuevo                 0.203220
antiguedad                0.000000
indrel                    0.203220
ult_fec_cli_1t           99.818330
indrel_1mes               1.097513
tiprel_1mes               1.097513
indresi                   0.203220
indext                    0.203220
conyuemp                 99.986752
canal_entrada             1.363829
indfall                   0.203220
tipodom                   0.203227
cod_prov                  0.685784
nomprov                   0.685784
ind_actividad_cliente     0.203220
renta                    20.475648
segmento                  1.387585
ind_ahor_fin_ult1         0.000000
ind_aval_fin_ult1         0.000000
ind_cco_fin_ult1          0.000000
ind_cder_fin_ult1         0.000000
ind_cno_fin_ult1          0.000000
ind_ctju_fin_ult1         0.000000
ind_ctma_fin_ult1         0.000000
ind_ctop_fin_ult1         0.000000
ind_ctpp_fin_ult1         0.000000
ind_deco_fin_ult1         0.000000
ind_deme_fin_ult1         0.000000
ind_dela_fin_ult1         0.000000
ind_ecue_fin_ult1         0.000000
ind_fond_fin_ult1         0.000000
ind_hip_fin_ult1          0.000000
ind_plan_fin_ult1         0.000000
ind_pres_fin_ult1         0.000000
ind_reca_fin_ult1         0.000000
ind_tjcr_fin_ult1         0.000000
ind_valo_fin_ult1         0.000000
ind_viv_fin_ult1          0.000000
ind_nomina_ult1           0.117701
ind_nom_pens_ult1         0.117701
ind_recibo_ult1           0.000000
dtype: float64

In [58]:
df_train.isnull().sum()

fecha_dato                      0
ncodpers                        0
ind_empleado                27734
pais_residencia             27734
sexo                        27804
age                             0
fecha_alta                  27734
ind_nuevo                   27734
antiguedad                      0
indrel                      27734
ult_fec_cli_1t           13622516
indrel_1mes                149781
tiprel_1mes                149781
indresi                     27734
indext                      27734
conyuemp                 13645501
canal_entrada              186126
indfall                     27734
tipodom                     27735
cod_prov                    93591
nomprov                     93591
ind_actividad_cliente       27734
renta                     2794375
segmento                   189368
ind_ahor_fin_ult1               0
ind_aval_fin_ult1               0
ind_cco_fin_ult1                0
ind_cder_fin_ult1               0
ind_cno_fin_ult1                0
ind_ctju_fin_ult1               0
ind_ctma_fin_ult1               0
ind_ctop_fin_ult1               0
ind_ctpp_fin_ult1               0
ind_deco_fin_ult1               0
ind_deme_fin_ult1               0
ind_dela_fin_ult1               0
ind_ecue_fin_ult1               0
ind_fond_fin_ult1               0
ind_hip_fin_ult1                0
ind_plan_fin_ult1               0
ind_pres_fin_ult1               0
ind_reca_fin_ult1               0
ind_tjcr_fin_ult1               0
ind_valo_fin_ult1               0
ind_viv_fin_ult1                0
ind_nomina_ult1             16063
ind_nom_pens_ult1           16063
ind_recibo_ult1                 0
dtype: int64

In [59]:
df_train.columns

Index(['fecha_dato', 'ncodpers', 'ind_empleado', 'pais_residencia', 'sexo',
       'age', 'fecha_alta', 'ind_nuevo', 'antiguedad', 'indrel',
       'ult_fec_cli_1t', 'indrel_1mes', 'tiprel_1mes', 'indresi', 'indext',
       'conyuemp', 'canal_entrada', 'indfall', 'tipodom', 'cod_prov',
       'nomprov', 'ind_actividad_cliente', 'renta', 'segmento',
       'ind_ahor_fin_ult1', 'ind_aval_fin_ult1', 'ind_cco_fin_ult1',
       'ind_cder_fin_ult1', 'ind_cno_fin_ult1', 'ind_ctju_fin_ult1',
       'ind_ctma_fin_ult1', 'ind_ctop_fin_ult1', 'ind_ctpp_fin_ult1',
       'ind_deco_fin_ult1', 'ind_deme_fin_ult1', 'ind_dela_fin_ult1',
       'ind_ecue_fin_ult1', 'ind_fond_fin_ult1', 'ind_hip_fin_ult1',
       'ind_plan_fin_ult1', 'ind_pres_fin_ult1', 'ind_reca_fin_ult1',
       'ind_tjcr_fin_ult1', 'ind_valo_fin_ult1', 'ind_viv_fin_ult1',
       'ind_nomina_ult1', 'ind_nom_pens_ult1', 'ind_recibo_ult1'],
      dtype='object')

In [60]:
len(df_train.columns)

48

In [ ]:
Checked whether customer code: 15889 from the test set exists in the train set?
    
And it does exist.

In [61]:
r1['ncodpers'].unique()

array([ 657640,  657788,  657795, ..., 1166763, 1166789, 1550586])

In [63]:
df_train['ncodpers'].to_csv('/Users/chidam/Desktop/train_set_customercode.csv')

/usr/local/Cellar/ipython/7.8.0/libexec/vendor/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: The signature of `Series.to_csv` was aligned to that of `DataFrame.to_csv`, and argument 'header' will change its default value from False to True: please pass an explicit value to suppress this warning.
  """Entry point for launching an IPython kernel.